{
  "modelTopology": {
    "class_name": "Model",
    "config": {
      "name": "model1",
      "layers": [
        {
          "name": "input1",
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              234
            ],
            "dtype": "float32",
            "sparse": false,
            "name": "input1"
          },
          "inbound_nodes": []
        },
        {
          "name": "dense_Dense1",
          "class_name": "Dense",
          "config": {
            "units": 256,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization1",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_Dense1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dropout_Dropout1",
          "class_name": "Dropout",
          "config": {
            "rate": 0.3,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout1",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dense_Dense2",
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_Dropout1",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "batch_normalization_BatchNormalization2",
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "momentum": 0.99,
            "epsilon": 0.001,
            "center": true,
            "scale": true,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "beta_regularizer": null,
            "gamma_regularizer": null,
            "beta_constraint": null,
            "gamma_constraint": null,
            "name": "batch_normalization_BatchNormalization2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_Dense2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dropout_Dropout2",
          "class_name": "Dropout",
          "config": {
            "rate": 0.2,
            "noise_shape": null,
            "seed": null,
            "name": "dropout_Dropout2",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_BatchNormalization2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "dense_Dense3",
          "class_name": "Dense",
          "config": {
            "units": 64,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "dense_Dense3",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dropout_Dropout2",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "action_output",
          "class_name": "Dense",
          "config": {
            "units": 55,
            "activation": "softmax",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "action_output",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_Dense3",
                0,
                0,
                {}
              ]
            ]
          ]
        },
        {
          "name": "value_output",
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "tanh",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "scale": 1,
                "mode": "fan_avg",
                "distribution": "normal",
                "seed": null
              }
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "kernel_regularizer": null,
            "bias_regularizer": null,
            "activity_regularizer": null,
            "kernel_constraint": null,
            "bias_constraint": null,
            "name": "value_output",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "dense_Dense3",
                0,
                0,
                {}
              ]
            ]
          ]
        }
      ],
      "input_layers": [
        [
          "input1",
          0,
          0
        ]
      ],
      "output_layers": [
        [
          "action_output",
          0,
          0
        ],
        [
          "value_output",
          0,
          0
        ]
      ]
    },
    "keras_version": "tfjs-layers 4.22.0",
    "backend": "tensor_flow.js"
  },
  "weightsManifest": [
    {
      "paths": [
        "weights.bin"
      ],
      "weights": [
        {
          "name": "dense_Dense1/kernel",
          "shape": [
            234,
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense1/bias",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/gamma",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/beta",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/kernel",
          "shape": [
            256,
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense2/bias",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/gamma",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/beta",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/kernel",
          "shape": [
            128,
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_Dense3/bias",
          "shape": [
            64
          ],
          "dtype": "float32"
        },
        {
          "name": "action_output/kernel",
          "shape": [
            64,
            55
          ],
          "dtype": "float32"
        },
        {
          "name": "action_output/bias",
          "shape": [
            55
          ],
          "dtype": "float32"
        },
        {
          "name": "value_output/kernel",
          "shape": [
            64,
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "value_output/bias",
          "shape": [
            1
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_mean",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization1/moving_variance",
          "shape": [
            256
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_mean",
          "shape": [
            128
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_BatchNormalization2/moving_variance",
          "shape": [
            128
          ],
          "dtype": "float32"
        }
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js tfjs-layers v4.22.0",
  "convertedBy": null
}